{
  "render": "\r\nThere are a lot of JavaScript MVC frameworks out there. Why did we build React\r\nand why would you want to use it?\r\n\r\n## React isn't an MVC framework. {/*react-isnt-an-mvc-framework*/}\r\n\r\nReact is a library for building composable user interfaces. It encourages\r\nthe creation of reusable UI components which present data that changes over\r\ntime.\r\n\r\n## React doesn't use templates. {/*react-doesnt-use-templates*/}\r\n\r\nTraditionally, web application UIs are built using templates or HTML directives.\r\nThese templates dictate the full set of abstractions that you are allowed to use\r\nto build your UI.\r\n\r\nReact approaches building user interfaces differently by breaking them into\r\n**components**. This means React uses a real, full featured programming language\r\nto render views, which we see as an advantage over templates for a few reasons:\r\n\r\n- **JavaScript is a flexible, powerful programming language** with the ability\r\n  to build abstractions. This is incredibly important in large applications.\r\n- By unifying your markup with its corresponding view logic, React can actually\r\n  make views **easier to extend and maintain**.\r\n- By baking an understanding of markup and content into JavaScript, there's\r\n  **no manual string concatenation** and therefore less surface area for XSS\r\n  vulnerabilities.\r\n\r\nWe've also created [JSX](/docs/jsx-in-depth.html), an optional syntax\r\nextension, in case you prefer the readability of HTML to raw JavaScript.\r\n\r\n## Reactive updates are dead simple. {/*reactive-updates-are-dead-simple*/}\r\n\r\nReact really shines when your data changes over time.\r\n\r\nIn a traditional JavaScript application, you need to look at what data changed\r\nand imperatively make changes to the DOM to keep it up-to-date. Even AngularJS,\r\nwhich provides a declarative interface via directives and data binding [requires\r\na linking function to manually update DOM nodes](https://code.angularjs.org/1.0.8/docs/guide/directive#reasonsbehindthecompilelinkseparation).\r\n\r\nReact takes a different approach.\r\n\r\nWhen your component is first initialized, the `render` method is called,\r\ngenerating a lightweight representation of your view. From that representation,\r\na string of markup is produced, and injected into the document. When your data\r\nchanges, the `render` method is called again. In order to perform updates as\r\nefficiently as possible, we diff the return value from the previous call to\r\n`render` with the new one, and generate a minimal set of changes to be applied\r\nto the DOM.\r\n\r\n> The data returned from `render` is neither a string nor a DOM node -- it's a\r\n> lightweight description of what the DOM should look like.\r\n\r\nWe call this process **reconciliation**. Check out\r\n[this jsFiddle](http://jsfiddle.net/2h6th4ju/) to see an example of\r\nreconciliation in action.\r\n\r\nBecause this re-render is so fast (around 1ms for TodoMVC), the developer\r\ndoesn't need to explicitly specify data bindings. We've found this approach\r\nmakes it easier to build apps.\r\n\r\n## HTML is just the beginning. {/*html-is-just-the-beginning*/}\r\n\r\nBecause React has its own lightweight representation of the document, we can do\r\nsome pretty cool things with it:\r\n\r\n- Facebook has dynamic charts that render to `<canvas>` instead of HTML.\r\n- Instagram is a \"single page\" web app built entirely with React and\r\n  `Backbone.Router`. Designers regularly contribute React code with JSX.\r\n- We've built internal prototypes that run React apps in a web worker and use\r\n  React to drive **native iOS views** via an Objective-C bridge.\r\n- You can run React\r\n  [on the server](https://github.com/petehunt/react-server-rendering-example)\r\n  for SEO, performance, code sharing and overall flexibility.\r\n- Events behave in a consistent, standards-compliant way in all browsers\r\n  (including IE8) and automatically use\r\n  [event delegation](http://davidwalsh.name/event-delegate).\r\n\r\nHead on over to [https://reactjs.org](https://reactjs.org) to check out what we have\r\nbuilt. Our documentation is geared towards building apps with the framework,\r\nbut if you are interested in the nuts and bolts\r\n[get in touch](/support.html) with us!\r\n\r\nThanks for reading!\r\n"
}